Revit 2026 API

# FamilyParameter Class

---

The family parameter object.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBFamilyParameter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilyParameter : APIObject
```
```vb
Public Class FamilyParameter
	Inherits APIObject
```
```cpp
public ref class FamilyParameter : public APIObject
```
```fsharp
type FamilyParameter =
    class
        inherit APIObject
    end
```

The FamilyParameter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssociatedParameters | The parameters from elements in the family which are associated to this parameter. |
|  | CanAssignFormula | Indicates if this parameter can be assigned a formula. |
|  | Definition | The definition. |
|  | Formula | The formula. |
|  | GUID | The globally unique identifier |
|  | Id | The id of the family parameter. |
|  | IsDeterminedByFormula | Indicates if the parameter is determined by formula. |
|  | IsInstance | Indicates if the parameter is instance or type. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Overrides APIObjectIsReadOnly) |
|  | IsReporting | Indicates if the parameter is a reporting parameter. |
|  | IsShared | Identifies if the parameter is a shared parameter. |
|  | StorageType | The storage type describes the type that is used internally within the parameter to store its value. |
|  | UserModifiable | Indicates whether the interactive user can modify the value of this parameter. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetUnitTypeId | Gets the identifier of the unit quantifying the parameter value. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace